In [1]:
# Import libraries
from pyspark.sql import SparkSession
from pyspark.sql import functions as func 
import pandas as pd

In [2]:
spark = SparkSession.builder.appName("Titanic").master("local[*]").getOrCreate()

In [3]:
titanic = spark.read.csv("titanic.csv",header = True)

In [4]:
titanic.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+-------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch| Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+-------+-------+-----+--------+
|        892|       0|     3|    Kelly, Mr. James|  male|34.5|    0|    0| 330911| 7.8292| null|       Q|
|        893|       1|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0| 363272|      7| null|       S|
|        894|       0|     2|Myles, Mr. Thomas...|  male|  62|    0|    0| 240276| 9.6875| null|       Q|
|        895|       0|     3|    Wirz, Mr. Albert|  male|  27|    0|    0| 315154| 8.6625| null|       S|
|        896|       1|     3|Hirvonen, Mrs. Al...|female|  22|    1|    1|3101298|12.2875| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+-------+-------+-----+--------+
only showing top 5 rows

In [5]:
titanic.printSchema()

root
 |-- PassengerId: string (nullable = true)
 |-- Survived: string (nullable = true)
 |-- Pclass: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: string (nullable = true)
 |-- SibSp: string (nullable = true)
 |-- Parch: string (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: string (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

The definition of the columns 
* PassengerId : Passenger number
* Survived : 0 = Dead 1 = Alive
* Pclass: 1 = First class 2 = Second class 3 = Third class
* Name: Name of passenger 
* Sex : male female
* Age : Age of passenger
* SibSp : Number of siblings
* Parch
* Ticket
* Fare
* Cabin
* Embarked : C = Cherbourg Q = Queenstown S = Southampton

In [6]:
titanic.columns

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [7]:
titanic.count()

418

In [8]:
titanic.distinct().count()

418

In [9]:
titanic.select("Cabin").distinct().show()

+-----------+
|      Cabin|
+-----------+
|         C6|
|         A9|
|        D28|
|        C78|
|    B58 B60|
|        D21|
|         F2|
|        E31|
|        C31|
|          F|
|    C22 C26|
|       C130|
|B51 B53 B55|
|        A21|
|        A18|
|        E50|
|       null|
|        E45|
|        D34|
|        D37|
+-----------+
only showing top 20 rows

In [10]:
titanic.select("Embarked").distinct().show()

+--------+
|Embarked|
+--------+
|       Q|
|       C|
|       S|
+--------+

# 1 - Survived

In [11]:
#The number of those who survived
titanic.filter(titanic.Survived == 1).count()

152

In [12]:
#The names of those who survived
titanic.select("name").filter("Survived == 1").show(10,truncate=False)

+-------------------------------------------------------+
|name                                                   |
+-------------------------------------------------------+
|Wilkes, Mrs. James (Ellen Needs)                       |
|Hirvonen, Mrs. Alexander (Helga E Lindqvist)           |
|Connolly, Miss. Kate                                   |
|Abrahim, Mrs. Joseph (Sophie Halaut Easu)              |
|Snyder, Mrs. John Pillsbury (Nelle Stevenson)          |
|Chaffee, Mrs. Herbert Fuller (Carrie Constance Toogood)|
|del Carlo, Mrs. Sebastiano (Argenia Genovesi)          |
|Ilmakangas, Miss. Ida Livija                           |
|"Assaf Khalil, Mrs. Mariana (Miriam"")"""              |
|Flegenheim, Mrs. Alfred (Antoinette)                   |
+-------------------------------------------------------+
only showing top 10 rows

In [13]:
#The number of males who Survived
titanic.filter((titanic.Survived == 1) & (titanic.Sex == "male")).count()

0

In [14]:
# The number of children who survived
titanic.filter((titanic.Survived == 1 ) & (titanic.Age < 18 ) ).count()

17

In [15]:
# The names of children who survived
titanic.select("Name","Age").filter((titanic.Survived == 1 ) & (titanic.Age < 18 )).show(truncate=False)

+---------------------------------------------+----+
|Name                                         |Age |
+---------------------------------------------+----+
|"Thomas, Mrs. Alexander (Thamine Thelma"")"""|16  |
|Sandstrom, Miss. Beatrice Irene              |1   |
|Watt, Miss. Bertha J                         |12  |
|Cribb, Miss. Laura Alice                     |17  |
|Goodwin, Miss. Jessie Allis                  |10  |
|Brown, Miss. Edith Eileen                    |15  |
|Quick, Miss. Winifred Vera                   |8   |
|West, Miss. Barbara J                        |0.92|
|Klasen, Miss. Gertrud Emilia                 |1   |
|Touma, Miss. Maria Youssef                   |9   |
|Rosblom, Miss. Salli Helena                  |2   |
|Laroche, Miss. Louise                        |1   |
|Hagardon, Miss. Kate                         |17  |
|Becker, Miss. Ruth Elizabeth                 |12  |
|Abelseth, Miss. Karen Marie                  |16  |
|Dean, Miss. Elizabeth Gladys Millvina""""    |0.17|
|Peacock, Miss. Treasteall                    |3   |
+---------------------------------------------+----+

In [16]:
# Those who survived and don't have a family
titanic.filter((titanic.Survived == 1) & (titanic.SibSp == 0)).count()

88

In [17]:
# Those who survived and don't have a family Names 
titanic.select("name").filter((titanic.Survived == 1) & (titanic.SibSp == 0)).show(truncate=False)

+---------------------------------------------------+
|name                                               |
+---------------------------------------------------+
|Connolly, Miss. Kate                               |
|Abrahim, Mrs. Joseph (Sophie Halaut Easu)          |
|"Assaf Khalil, Mrs. Mariana (Miriam"")"""          |
|Flegenheim, Mrs. Alfred (Antoinette)               |
|Ostby, Miss. Helene Ragnhild                       |
|Roth, Miss. Sarah A                                |
|Cacic, Miss. Manda                                 |
|Corbett, Mrs. Walter H (Irene Colvin)              |
|Bucknell, Mrs. William Robert (Emma Eliza Ward)    |
|"Coutts, Mrs. William (Winnie Minnie"" Treanor)""" |
|Chaudanson, Miss. Victorine                        |
|Bradley, Miss. Bridget Delia                       |
|Corey, Mrs. Percy C (Mary Phyllis Elizabeth Miller)|
|Burns, Miss. Mary Delia                            |
|Mulvihill, Miss. Bertha E                          |
|Nieminen, Miss. Manta Josefina                     |
|Geiger, Miss. Amalie                               |
|Doyle, Miss. Elizabeth                             |
|Barry, Miss. Julia                                 |
|Badman, Miss. Emily Louisa                         |
+---------------------------------------------------+
only showing top 20 rows

In [18]:
# Those who survived and  have a family
titanic.filter((titanic.Survived == 1) & (titanic.SibSp > 0)).count()

64

In [19]:
# Those who survived and  have a family Names
titanic.select("name").filter((titanic.Survived == 1) & (titanic.SibSp > 0)).show(truncate=False)

+-----------------------------------------------------------+
|name                                                       |
+-----------------------------------------------------------+
|Wilkes, Mrs. James (Ellen Needs)                           |
|Hirvonen, Mrs. Alexander (Helga E Lindqvist)               |
|Snyder, Mrs. John Pillsbury (Nelle Stevenson)              |
|Chaffee, Mrs. Herbert Fuller (Carrie Constance Toogood)    |
|del Carlo, Mrs. Sebastiano (Argenia Genovesi)              |
|Ilmakangas, Miss. Ida Livija                               |
|Ryerson, Mrs. Arthur Larned (Emily Maria Borie)            |
|Dean, Mrs. Bertram (Eva Georgetta Light)                   |
|"Johnston, Mrs. Andrew G (Elizabeth Lily"" Watson)"""      |
|Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)           |
|Hocking, Miss. Ellen Nellie""""                            |
|Fortune, Miss. Ethel Flora                                 |
|Fortune, Mrs. Mark (Mary McDougald)                        |
|Cornell, Mrs. Robert Clifford (Malvina Helen Lamson)       |
|Dyker, Mrs. Adolf Fredrik (Anna Elisabeth Judith Andersson)|
|Davidson, Mrs. Thornton (Orian Hays)                       |
|Cavendish, Mrs. Tyrell William (Julia Florence Siegel)     |
|Stengel, Mrs. Charles Emil Henry (Annie May Morris)        |
|"Thomas, Mrs. Alexander (Thamine Thelma"")"""              |
|Straus, Mrs. Isidor (Rosalie Ida Blun)                     |
+-----------------------------------------------------------+
only showing top 20 rows

# 2 - diead

In [20]:
#The number of those who diead
titanic.filter("Survived == 0").count()

266

In [22]:
#The names of those who diead
titanic.select("name").filter("Survived == 0").show(5,truncate=False)

+----------------------------+
|name                        |
+----------------------------+
|Kelly, Mr. James            |
|Myles, Mr. Thomas Francis   |
|Wirz, Mr. Albert            |
|Svensson, Mr. Johan Cervin  |
|Caldwell, Mr. Albert Francis|
+----------------------------+
only showing top 5 rows

In [26]:
#The number of males who diead
titanic.filter((titanic.Survived == 0) & (titanic.Sex == "male")).count()

266

In [28]:
# The number of children who diead
titanic.filter((titanic.Survived == 0) & (titanic.Age < 18 )).count()

24

In [33]:
# The names of children who diead
titanic.select("name","age").filter((titanic.Survived == 0) & (titanic.Age <18)).show(truncate=False)

+---------------------------------------+----+
|name                                   |age |
+---------------------------------------+----+
|Svensson, Mr. Johan Cervin             |14  |
|Olsen, Master. Artur Karl              |9   |
|Rice, Master. Albert                   |10  |
|Dika, Mr. Mirko                        |17  |
|Ryerson, Master. John Borie            |13  |
|Boulos, Master. Akar                   |6   |
|Wells, Master. Ralph Lester            |2   |
|Asplund, Master. Filip Oscar           |13  |
|Touma, Master. Georges Youssef         |7   |
|Davies, Mr. Joseph                     |17  |
|van Billiard, Master. Walter John      |11.5|
|Drew, Master. Marshall Brines          |8   |
|Spedden, Master. Robert Douglas        |6   |
|Danbom, Master. Gilbert Sigvard Emanuel|0.33|
|Deacon, Mr. Percy William              |17  |
|Sweet, Mr. George Frederick            |14  |
|Pokrnic, Mr. Mate                      |17  |
|Peacock, Master. Alfred Edward         |0.75|
|Aks, Master. Philip Frank              |0.83|
|Sage, Master. William Henry            |14.5|
+---------------------------------------+----+
only showing top 20 rows

In [35]:
# Those who diead and don't have a family
titanic.filter((titanic.Survived == 0) & (titanic.SibSp == 0)).count()

195

In [38]:
# Those who diead and don't have a family Names 
titanic.select("name").filter((titanic.Survived == 0) & (titanic.SibSp == 0)).show(5,truncate=False)

+--------------------------+
|name                      |
+--------------------------+
|Kelly, Mr. James          |
|Myles, Mr. Thomas Francis |
|Wirz, Mr. Albert          |
|Svensson, Mr. Johan Cervin|
|Ilieff, Mr. Ylio          |
+--------------------------+
only showing top 5 rows

In [39]:
# Those who diead and  have a family
titanic.filter((titanic.Survived == 0) & (titanic.SibSp > 0)).count()

71

In [40]:
# Those who diead and  have a family Names
titanic.select("name").filter((titanic.Survived == 0) & (titanic.SibSp > 0)).show(5,truncate=False)

+----------------------------+
|name                        |
+----------------------------+
|Caldwell, Mr. Albert Francis|
|Davies, Mr. John Samuel     |
|Howard, Mr. Benjamin        |
|Rothschild, Mr. Martin      |
|Robins, Mr. Alexander A     |
+----------------------------+
only showing top 5 rows

# 3 - Pclass

In [43]:
titanic.select("Pclass").distinct().show()

+------+
|Pclass|
+------+
|     3|
|     1|
|     2|
+------+

In [47]:
titanic.filter("Pclass is null").count()

0

In [53]:
titanic.filter("Pclass == 1").count()

107

In [51]:
titanic.filter("Pclass == 2").count()

93

In [54]:
titanic.filter("Pclass == 3").count()

218

# Create DataBase

In [5]:
import psycopg2 as ps

In [6]:
# connect to default database
conn = ps.connect("host=127.0.0.1 user=postgres_user password=postgres_password")
conn.set_session(autocommit=True)
cur = conn.cursor()

In [ ]:
# create Titanic database with UTF8 encoding
cur.execute("DROP DATABASE IF EXISTS 'titanic'")
cur.execute("CREATE DATABASE TITANIC WITH ENCODING 'utf8' ")
conn.close()

In [9]:
# connect to titanic database
conn = ps.connect("host=127.0.0.1 dbname=db_name user=postgres_user password=postgres_password")
conn.set_session(autocommit=True)
cur = conn.cursor()

In [14]:
titanic.show(2)

+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|Ticket|  Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
|        892|       0|     3|    Kelly, Mr. James|  male|34.5|    0|    0|330911|7.8292| null|       Q|
|        893|       1|     3|Wilkes, Mrs. Jame...|female|  47|    1|    0|363272|     7| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+------+------+-----+--------+
only showing top 2 rows

# Create titanic Table

In [33]:
# create Titanic table 
cur.execute("""CREATE TABLE IF NOT EXISTS titanic (
           passengerId INT PRIMARY KEY ,
           survived INT NOT NULL,
           pclass CHAR NOT NULL,
           name VARCHAR NOT NULL,
           sex VARCHAR NOT NULL,
           age FLOAT NOT NULL,
           sibSp INT ,
           parch VARCHAR,
           ticket VARCHAR,
           fare FLOAT,
           cabin VARCHAR,
           embarked CHAR
           )""")
conn.commit()

# Load Data

In [21]:

titanic_table_insert = ("""
INSERT INTO titanic(passengerId,survived,pclass,name,sex,age,sibSp,parch,ticket,fare,cabin,embarked) 
        VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s);
""")

In [22]:
df = pd.read_csv("titanic.csv")

In [23]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [34]:
for i, row in df.iterrows():
    cur.execute(titanic_table_insert, row)
    conn.commit()

# Test Data

In [35]:
%load_ext sql

In [36]:
%sql postgresql://postgres_user:postgres_password@127.0.0.1/titanic

In [37]:
%sql select * from titanic limit 10;

 * postgresql://postgres:***@127.0.0.1/titanic
10 rows affected.

[(892, 0, '3', 'Kelly, Mr. James', 'male', 34.5, 0, '0', '330911', 7.8292, 'NaN', 'Q'),
 (893, 1, '3', 'Wilkes, Mrs. James (Ellen Needs)', 'female', 47.0, 1, '0', '363272', 7.0, 'NaN', 'S'),
 (894, 0, '2', 'Myles, Mr. Thomas Francis', 'male', 62.0, 0, '0', '240276', 9.6875, 'NaN', 'Q'),
 (895, 0, '3', 'Wirz, Mr. Albert', 'male', 27.0, 0, '0', '315154', 8.6625, 'NaN', 'S'),
 (896, 1, '3', 'Hirvonen, Mrs. Alexander (Helga E Lindqvist)', 'female', 22.0, 1, '1', '3101298', 12.2875, 'NaN', 'S'),
 (897, 0, '3', 'Svensson, Mr. Johan Cervin', 'male', 14.0, 0, '0', '7538', 9.225, 'NaN', 'S'),
 (898, 1, '3', 'Connolly, Miss. Kate', 'female', 30.0, 0, '0', '330972', 7.6292, 'NaN', 'Q'),
 (899, 0, '2', 'Caldwell, Mr. Albert Francis', 'male', 26.0, 1, '1', '248738', 29.0, 'NaN', 'S'),
 (900, 1, '3', 'Abrahim, Mrs. Joseph (Sophie Halaut Easu)', 'female', 18.0, 0, '0', '2657', 7.2292, 'NaN', 'C'),
 (901, 0, '3', 'Davies, Mr. John Samuel', 'male', 21.0, 2, '0', 'A/4 48871', 24.15, 'NaN', 'S')]

In [38]:
%sql select count(*) from titanic;

 * postgresql://postgres:***@127.0.0.1/titanic
1 rows affected.

[(418,)]